[{
    "Name": "Blade Ward",
    "Range": "Self",
    "Level": "cantrip",
    "CastTime": "1 action",
    "Description": "You extend your hand and trace a sigil of warding in the air. Until the end of your next turn, you have resistance against bludgeoning, piercing, and slashing damage dealt by weapon attacks.",
    "Duration": "1 round",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": ""
},
{
    "Name": "Resistance",
    "Range": "Touch",
    "Level": "cantrip",
    "CastTime": "1 action",
    "Description": "You touch one willing creature. Once before the spell ends, the target can roll a d4 and add the number rolled to one saving throw of its choice. It can roll the die before or after the saving throw. The spell then ends.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Artificer",
        "Cleric",
        "Druid"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a miniature cloak"
    ],
    "HigherLevels": ""
},
{
    "Name": "Alarm",
    "Range": "30 feet",
    "Level": "1st-level",
    "CastTime": "1 minute",
    "Description": "You set an alarm against unwanted intrusion. Choose a door, a window, or an area within range that is no larger than a 20-foot cube. Until the spell ends, an alarm alerts you whenever a tiny or larger creature touches or enters the warded area. When you cast the spell, you can designate creatures that won’t set off the alarm. You also choose whether the alarm is mental or audible.A mental alarm alerts you with a ping in your mind if you are within 1 mile of the warded area. This ping awakens you if you are sleeping. An audible alarm produces the sound of a hand bell for 10 seconds within 60 feet.",
    "Duration": "8 hours",
    "Concentration": "False",
    "Ritual": "True",
    "ClassList": [
        "Artificer",
        "Ranger",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a tiny bell and a piece of fine silver wire"
    ],
    "HigherLevels": ""
},
{
    "Name": "Armor of Agathys",
    "Range": "Self",
    "Level": "1st-level",
    "CastTime": "1 action",
    "Description": "A protective magical force surrounds you, manifesting as a spectral frost that covers you and your gear. You gain 5 temporary hit points for the duration. If a creature hits you with a melee attack while you have these hit points, the creature takes 5 cold damage.",
    "Duration": "1 hour",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Warlock"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a cup of water"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 2nd level or higher, both the temporary hit points and the cold damage increase by 5 for each slot."
},
{
    "Name": "Mage Armor",
    "Range": "Touch",
    "Level": "1st-level",
    "CastTime": "1 action",
    "Description": "You touch a willing creature who isn’t wearing armor, and a protective magical force surrounds it until the spell ends. The target’s base AC becomes 13 + its Dexterity modifier. The spell ends if the target dons armor or if you dismiss the spell as an action.",
    "Duration": "8 hours",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Sorcerer",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a piece of cured leather"
    ],
    "HigherLevels": ""
},
{
    "Name": "Protection from Evil and Good",
    "Range": "Touch",
    "Level": "1st-level",
    "CastTime": "1 action",
    "Description": "Until the spell ends, one willing creature you touch is protected against certain types of creatures: aberrations, celestials, elementals, fey, fiends, and undead.The protection grants several benefits. Creatures of those types have disadvantage on attack rolls against the target. The target also can't be charmed, frightened, or possessed by them. If the target is already charmed, frightened, or possessed by such a creature, the target has advantage on any new saving throw against the relevant effect.",
    "Duration": "Concentration, up to 10 minutes",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Cleric",
        "Druid (Optional)",
        "Paladin",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "holy water or powdered silver and iron, which the spell consumes"
    ],
    "HigherLevels": ""
},
{
    "Name": "Sanctuary",
    "Range": "30 feet",
    "Level": "1st-level",
    "CastTime": "1 bonus action",
    "Description": "You ward a creature within range against attack. Until the spell ends, any creature who targets the warded creature with an attack or a harmful spell must first make a Wisdom saving throw. On a failed save, the creature must choose a new target or lose the attack or spell. This spell doesn’t protect the warded creature from area effects, such as the explosion of a fireball.If the warded creature makes an attack, casts a spell that affects an enemy, or deals damage to another creature, this spell ends.",
    "Duration": "1 minute",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Artificer",
        "Cleric"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a small silver mirror"
    ],
    "HigherLevels": ""
},
{
    "Name": "Shield",
    "Range": "Self",
    "Level": "1st-level",
    "CastTime": "1 reaction",
    "Description": "An invisible barrier of magical force appears and protects you. Until the start of your next turn, you have a +5 bonus to AC, including against the triggering attack, and you take no damage from magic missile.",
    "Duration": "1 round",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Sorcerer",
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": ""
},
{
    "Name": "Shield of Faith",
    "Range": "60 feet",
    "Level": "1st-level",
    "CastTime": "1 bonus action",
    "Description": "A shimmering field appears and surrounds a creature of your choice within range, granting it a +2 bonus to AC for the duration.",
    "Duration": "Concentration, up to 10 minutes",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Cleric",
        "Paladin"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a small parchment with a bit of holy text written on it"
    ],
    "HigherLevels": ""
},
{
    "Name": "Aid",
    "Range": "30 feet",
    "Level": "2nd-level",
    "CastTime": "1 action",
    "Description": "Your spell bolsters your allies with toughness and resolve. Choose up to three creatures within range. Each target’s hit point maximum and current hit points increase by 5 for the duration.",
    "Duration": "8 hours",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Artificer",
        "Bard (Optional)",
        "Cleric",
        "Paladin",
        "Ranger (Optional)"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a tiny strip of white cloth"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 3rd level or higher, a target’s hit points increase by an additional 5 for each slot level above 2nd."
},
{
    "Name": "Arcane Lock",
    "Range": "Touch",
    "Level": "2nd-level",
    "CastTime": "1 action",
    "Description": "You touch a closed door, window, gate, chest, or other entryway, and it becomes locked for the duration.You and the creatures you designate when you cast this spell can open the object normally. You can also set a password that, when spoken within 5 feet of the object, suppresses this spell for 1 minute. Otherwise, it is impassable until it is broken or the spell is dispelled or suppressed. Casting Knock on the object suppresses Arcane Lock for 10 minutes.While affected by this spell, the object is more difficult to break or force open; the DC to break it or pick any locks on it increases by 10.",
    "Duration": "Until dispelled",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Artificer",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "gold dust worth at least 25 gp, which the spell consumes"
    ],
    "HigherLevels": ""
},
{
    "Name": "Lesser Restoration",
    "Range": "Touch",
    "Level": "2nd-level",
    "CastTime": "1 action",
    "Description": "You touch a creature and can end either one disease or one condition afflicting it. The condition can be blinded, deafened, paralyzed, or poisoned.",
    "Duration": "Instantaneous",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Artificer",
        "Bard",
        "Cleric",
        "Druid",
        "Paladin",
        "Ranger"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": ""
},
{
    "Name": "Pass Without Trace",
    "Range": "Self",
    "Level": "2nd-level",
    "CastTime": "1 action",
    "Description": "A veil of shadows and silence radiates from you, masking you and your companions from detection. For the duration, each creature you choose within 30 feet of you (including you) has a +10 bonus to Dexterity (Stealth) checks and can’t be tracked except by magical means. A creature that receives this bonus leaves behind no tracks or other traces of its passage.",
    "Duration": "Concentration, up to 1 hour",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Druid",
        "Ranger"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "ashes from a burned leaf of mistletoe and a sprig of spruce"
    ],
    "HigherLevels": ""
},
{
    "Name": "Protection from Poison",
    "Range": "Touch",
    "Level": "2nd-level",
    "CastTime": "1 action",
    "Description": "You touch a creature. If it is poisoned, you neutralize the poison. If more than one poison afflicts the target, you neutralize one poison that you know is present, or you neutralize one at random.For the duration, the target has advantage on saving throws against being poisoned, and it has resistance to poison damage.",
    "Duration": "1 hour",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Artificer",
        "Cleric",
        "Druid",
        "Paladin",
        "Ranger"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": ""
},
{
    "Name": "Warding Bond",
    "Range": "Touch",
    "Level": "2nd-level",
    "CastTime": "1 action",
    "Description": "This spell wards a willing creature you touch and creates a mystic connection between you and the target until the spell ends.While the target is within 60 feet of you, it gains a +1 bonus to AC and saving throws, and it has resistance to all damage. Also, each time it takes damage, you take the same amount of damage.The spell ends if you drop to 0 hit points or if you and the target become separated by more than 60 feet. It also ends if the spell is cast again on either of the connected creatures. You can also dismiss the spell as an action.",
    "Duration": "1 hour",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Cleric",
        "Paladin (Optional)"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a pair of platinum rings worth at least 50 gp each, which you and target must wear for the duration"
    ],
    "HigherLevels": ""
},
{
    "Name": "Beacon of Hope",
    "Range": "30 feet",
    "Level": "3rd-level",
    "CastTime": "1 action",
    "Description": "This spell bestows hope and vitality. Choose any number of creatures within range. For the duration, each target has advantage on Wisdom saving throws and death saving throws, and regains the maximum number of hit points possible from any healing.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Cleric"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": ""
},
{
    "Name": "Counterspell",
    "Range": "60 feet",
    "Level": "3rd-level",
    "CastTime": "1 reaction",
    "Description": "You attempt to interrupt a creature in the process of casting a spell. If the creature is casting a spell of 3rd level or lower, its spell fails and has no effect. If it is casting a spell of 4th level or higher, make an ability check using your spellcasting ability. The DC equals 10 + the spell’s level. On a success, the creature’s spell fails and has no effect.",
    "Duration": "Instantaneous",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Sorcerer",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "S"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 4th level or higher, the interrupted spell has no effect if its level is less than or equal to the level of the spell slot you used."
},
{
    "Name": "Dispel Magic",
    "Range": "120 feet",
    "Level": "3rd-level",
    "CastTime": "1 action",
    "Description": "Choose any creature, object, or magical effect within range. Any spell of 3rd level or lower on the target ends. For each spell of 4th level or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a successful check, the spell ends.",
    "Duration": "Instantaneous",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Artificer",
        "Bard",
        "Cleric",
        "Druid",
        "Paladin",
        "Sorcerer",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 4th level or higher, you automatically end the effects of a spell on the target if the spell's level is equal to or less than the level of the spell slot you used."
},
{
    "Name": "Glyph of Warding",
    "Range": "Touch",
    "Level": "3rd-level",
    "CastTime": "1 hour",
    "Description": "When you cast this spell, you inscribe a glyph that creates a magical effect triggered by other creatures, either upon a surface (such as a table or a section of floor or wall) or within an object that can be closed (such as a book, a scroll, or a treasure chest) to conceal the glyph. The glyph can cover an area no larger than 10 feet in diameter. If the surface or object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered.The glyph is nearly invisible and requires a successful Intelligence (Investigation) check against your spell save DC to be found.You decide what triggers the glyph when you cast the spell. For glyphs inscribed on a surface, the most typical triggers include touching or standing on the glyph, removing another object covering the glyph, approaching within a certain distance of the glyph, or manipulating the object on which the glyph is inscribed. For glyphs inscribed within an object, the most common triggers include opening that object, approaching within a certain distance of the object, or seeing or reading the glyph. Once a glyph is triggered, this spell ends.You can further refine the trigger so the spell activates only under certain circumstances or according to physical characteristics (such as height or weight), creature kind (for example, the ward could be set to affect aberrations or drow), or alignment. You can also set conditions for creatures that don’t trigger the glyph, such as those who say a certain password.When you inscribe the glyph, choose explosive runes or a spell glyph.Explosive Runes. When triggered, the glyph erupts with magical energy in a 20-foot-radius sphere centered on the glyph. The sphere spreads around corners. Each creature in the area must make a Dexterity saving throw. A creature takes 5d8 acid, cold, fire, lightning, or thunder damage on a failed saving throw (your choice when you create the glyph), or half as much damage on a successful one.Spell Glyph. You can store a prepared spell of 3rd level or lower in the glyph by casting it as part of creating the glyph. The spell must target a single creature or an area. The spell being stored has no immediate effect when cast in this way. When the glyph is triggered, the stored spell is cast. If the spell has a target, it targets the creature that triggered the glyph. If the spell affects an area, the area is centered on that creature. If the spell summons hostile creatures or creates harmful objects or traps, they appear as close as possible to the intruder and attack it. If the spell requires concentration, it lasts until the end of its full duration.",
    "Duration": "Until dispelled or triggered",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Artificer",
        "Bard",
        "Cleric",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "incense and powdered diamond worth at least 200 gp, which the spell consumes"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 4th level or higher, the damage of an explosive runes glyph increases by 1d8 for each slot level above 3rd. If you create a spell glyph, you can store any spell of up to the same level as the slot you use for the glyph of warding."
},
{
    "Name": "Magic Circle",
    "Range": "10 feet",
    "Level": "3rd-level",
    "CastTime": "1 minute",
    "Description": "You create a 10-foot-radius, 20-foot-tall cylinder of magical energy centered on a point on the ground that you can see within range. Glowing runes appear wherever the cylinder intersects with the floor or other surface.Choose one or more of the following types of creatures: celestials, elementals, fey, fiends, or undead. The circle affects a creature of the chosen type in the following ways:    The creature can’t willingly enter the cylinder by nonmagical means. If the creature tries to use teleportation or interplanar travel to do so, it must first succeed on a Charisma saving throw.    The creature has disadvantage on attack rolls against targets within the cylinder.    Targets within the cylinder can’t be charmed, frightened, or possessed by the creature.When you cast this spell, you can elect to cause its magic to operate in the reverse direction, preventing a creature of the specified type from leaving the cylinder and protecting targets outside it.",
    "Duration": "1 hour",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Cleric",
        "Paladin",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "holy water or powdered silver and iron worth at least 100 gp, which the spell consumes"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 4th level or higher, the duration increases by 1 hour for each slot level above 3rd."
},
{
    "Name": "Nondetection",
    "Range": "Touch",
    "Level": "3rd-level",
    "CastTime": "1 action",
    "Description": "For the duration, you hide a target that you touch from divination magic. The target can be a willing creature or a place or an object no larger than 10 feet in any dimension. The target can’t be targeted by any divination magic or perceived through magical scrying sensors.",
    "Duration": "8 hours",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Ranger",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a pinch of diamond dust worth 25 gp sprinkled over the target, which the spell consumes"
    ],
    "HigherLevels": ""
},
{
    "Name": "Protection from Energy",
    "Range": "Touch",
    "Level": "3rd-level",
    "CastTime": "1 action",
    "Description": "For the duration, the willing creature you touch has resistance to one damage type of your choice: acid, cold, fire, lightning, or thunder.",
    "Duration": "Concentration, up to 1 hour",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Artificer",
        "Cleric",
        "Druid",
        "Ranger",
        "Sorcerer",
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": ""
},
{
    "Name": "Remove Curse",
    "Range": "Touch",
    "Level": "3rd-level",
    "CastTime": "1 action",
    "Description": "At your touch, all curses affecting one creature or object end. If the object is a cursed magic item, its curse remains, but the spell breaks its owner’s attunement to the object so it can be removed or discarded.",
    "Duration": "Instantaneous",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Cleric",
        "Paladin",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": ""
}]