[{
    "Name": "Friends",
    "Range": "Self",
    "Level": "cantrip",
    "CastTime": "1 action",
    "Description": "For the duration, you have advantage on all Charisma checks directed at one creature of your choice that isn't hostile toward you. When the spell ends, the creature realizes that you used magic to influence its mood and becomes hostile toward you. A creature prone to violence might attack you. Another creature might seek retribution in other ways (at the DM's discretion), depending on the nature of your interaction with it.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "S",
        "M",
        "a small amount of makeup applied to the face as this spell is cast"
    ],
    "HigherLevels": ""
},
{
    "Name": "Animal Friendship",
    "Range": "30 feet",
    "Level": "1st-level",
    "CastTime": "1 action",
    "Description": "This spell lets you convince a beast that you mean it no harm. Choose a beast that you can see within range. It must see and hear you. If the beast’s Intelligence is 4 or higher, the spell fails. Otherwise, the beast must succeed on a Wisdom saving throw or be charmed by you for the spell’s duration. If you or one of your companions harms the target, the spell ends.",
    "Duration": "24 hours",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Druid",
        "Ranger"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a morsel of food"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 2nd level or higher, you can affect one additional beast for each slot level above 1st."
},
{
    "Name": "Bane",
    "Range": "30 feet",
    "Level": "1st-level",
    "CastTime": "1 action",
    "Description": "Up to three creatures of your choice that you can see within range must make Charisma saving throws. Whenever a target that fails this saving throw makes an attack roll or a saving throw before the spell ends, the target must roll a d4 and subtract the number rolled from the attack roll or saving throw.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Cleric"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a drop of blood"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st."
},
{
    "Name": "Bless",
    "Range": "30 feet",
    "Level": "1st-level",
    "CastTime": "1 action",
    "Description": "You bless up to three creatures of your choice within range. Whenever a target makes an attack roll or a saving throw before the spell ends, the target can roll a d4 and add the number rolled to the attack roll or saving throw.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Cleric",
        "Paladin"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a sprinkling of holy water"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st."
},
{
    "Name": "Charm Person",
    "Range": "30 feet",
    "Level": "1st-level",
    "CastTime": "1 action",
    "Description": "You attempt to charm a humanoid you can see within range. It must make a Wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature regards you as a friendly acquaintance. When the spell ends, the creature knows it was charmed by you.",
    "Duration": "1 hour",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Druid",
        "Sorcerer",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them."
},
{
    "Name": "Command",
    "Range": "60 feet",
    "Level": "1st-level",
    "CastTime": "1 action",
    "Description": "You speak a one-word command to a creature you can see within range. The target must succeed on a Wisdom saving throw or follow the command on its next turn. The spell has no effect if the target is undead, if it doesn’t understand your language, or if your command is directly harmful to it. Some typical commands and their effects follow. You might issue a command other than one described here. If you do so, the DM determines how the target behaves. If the target can’t follow your command, the spell ends.Approach. The target moves toward you by the shortest and most direct route, ending its turn if it moves within 5 feet of you.Drop. The target drops whatever it is holding and then ends its turn.Flee. The target spends its turn moving away from you by the fastest available means.Grovel. The target falls prone and then ends its turn.Halt. The target doesn’t move and takes no actions. A flying creature stays aloft, provided that it is able to do so. If it must move to stay aloft, it flies the minimum distance needed to remain in the air.",
    "Duration": "1 round",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Bard (Optional)",
        "Cleric",
        "Paladin"
    ],
    "Components": [
        "V"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 2nd level or higher, you can affect one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them."
},
{
    "Name": "Compelled Duel",
    "Range": "30 feet",
    "Level": "1st-level",
    "CastTime": "1 bonus action",
    "Description": "You attempt to compel a creature into a duel. One creature that you can see within range must make a Wisdom saving throw. On a failed save, the creature is drawn to you, compelled by your divine demand. For the duration, it has disadvantage on attack rolls against creatures other than you, and must make a Wisdom saving throw each time it attempts to move to a space that is more than 30 feet away from you; if it succeeds on this saving throw, this spell doesn’t restrict the target’s movement for that turn.The spell ends if you attack any other creature, if you cast a spell that targets a hostile creature other than the target, if a creature friendly to you damages the target or casts a harmful spell on it, or if you end your turn more than 30 feet away from the target.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Paladin"
    ],
    "Components": [
        "V"
    ],
    "HigherLevels": ""
},
{
    "Name": "Dissonant Whispers",
    "Range": "60 feet",
    "Level": "1st-level",
    "CastTime": "1 action",
    "Description": "You whisper a discordant melody that only one creature of your choice within range can hear, wracking it with terrible pain. The target must make a Wisdom saving throw. On a failed save, it takes 3d6 psychic damage and must immediately use its reaction, if available, to move as far as its speed allows away from you. The creature doesn’t move into obviously dangerous ground, such as a fire or a pit. On a successful save, the target takes half as much damage and doesn’t have to move away. A deafened creature automatically succeeds on the save.",
    "Duration": "Instantaneous",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Bard"
    ],
    "Components": [
        "V"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st."
},
{
    "Name": "Heroism",
    "Range": "Touch",
    "Level": "1st-level",
    "CastTime": "1 action",
    "Description": "A willing creature you touch is imbued with bravery. Until the spell ends, the creature is immune to being frightened and gains temporary hit points equal to your spellcasting ability modifier at the start of each of its turns. When the spell ends, the target loses any remaining temporary hit points from this spell.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Paladin"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st."
},
{
    "Name": "Hex",
    "Range": "90 feet",
    "Level": "1st-level",
    "CastTime": "1 bonus action",
    "Description": "You place a curse on a creature that you can see within range. Until the spell ends, you deal an extra 1d6 necrotic damage to the target whenever you hit it with an attack. Also, choose one ability when you cast the spell. The target has disadvantage on ability checks made with the chosen ability.If the target drops to 0 hit points before this spell ends, you can use a bonus action on a subsequent turn of yours to curse a new creature.A Remove Curse cast on the target ends this spell early.",
    "Duration": "Concentration, up to 1 hour",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Warlock"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "the petrified eye of a newt"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 3rd or 4th level, you can maintain your concentration on the spell for up to 8 hours. When you use a spell slot of 5th level or higher, you can maintain your concentration on the spell for up to 24 hours."
},
{
    "Name": "Sleep",
    "Range": "90 feet",
    "Level": "1st-level",
    "CastTime": "1 action",
    "Description": "This spell sends creatures into a magical slumber. Roll 5d8, the total is how many hit points of creatures this spell can affect. Creatures within 20 feet of a point you choose within range are affected in ascending order of their current hit points (ignoring unconscious creatures).Starting with the creature that has the lowest current hit points, each creature affected by this spell falls unconscious until the spell ends, the sleeper takes damage, or someone uses an action to shake or slap the sleeper awake. Subtract each creature’s hit points from the total before moving on to the creature with the next lowest hit points. A creature’s hit points must be equal to or less than the remaining total for that creature to be affected. Undead and creatures immune to being charmed aren’t affected by this spell.",
    "Duration": "1 minute",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Sorcerer",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a pinch of fine sand, rose petals, or a cricket"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 2nd level or higher, roll an additional 2d8 for each slot level above 1st."
},
{
    "Name": "Tasha's Hideous Laughter",
    "Range": "30 feet",
    "Level": "1st-level",
    "CastTime": "1 action",
    "Description": "A creature of your choice that you can see within range perceives everything as hilariously funny and falls into fits of laughter if this spell affects it. The target must succeed on a Wisdom saving throw or fall prone, becoming incapacitated and unable to stand up for the duration. A creature with an Intelligence score of 4 or less isn’t affected.At the end of each of its turns, and each time it takes damage, the target can make another Wisdom saving throw. The target has advantage on the saving throw if it’s triggered by damage. On a success, the spell ends.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "tiny tarts and a feather that is waved in the air"
    ],
    "HigherLevels": ""
},
{
    "Name": "Animal Messenger",
    "Range": "30 feet",
    "Level": "2nd-level",
    "CastTime": "1 action",
    "Description": "By means of this spell, you use an animal to deliver a message. Choose a Tiny beast you can see within range, such as a squirrel, a blue jay, or a bat. You specify a location, which you must have visited, and a recipient who matches a general description, such as “a man or woman dressed in the uniform of the town guard” or “a red-haired dwarf wearing a pointed hat.” You also speak a message of up to twenty-five words. The target beast travels for the duration of the spell toward the specified location, covering about 50 miles per 24 hours for a flying messenger, or 25 miles for other animals.When the messenger arrives, it delivers your message to the creature that you described, replicating the sound of your voice. The messenger speaks only to a creature matching the description you gave. If the messenger doesn’t reach its destination before the spell ends, the message is lost, and the beast makes its way back to where you cast this spell.",
    "Duration": "24 hours",
    "Concentration": "False",
    "Ritual": "True",
    "ClassList": [
        "Bard",
        "Druid",
        "Ranger"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a morsel of food"
    ],
    "HigherLevels": "If you cast this spell using a spell slot of 3rd level or higher, the duration of the spell increases by 48 hours for each slot level above 2nd."
},
{
    "Name": "Calm Emotions",
    "Range": "60 feet",
    "Level": "2nd-level",
    "CastTime": "1 action",
    "Description": "You attempt to suppress strong emotions in a group of people. Each humanoid in a 20-foot-radius sphere centered on a point you choose within range must make a Charisma saving throw; a creature can choose to fail this saving throw if it wishes. If a creature fails its saving throw, choose one of the following two effects. You can suppress any effect causing a target to be charmed or frightened. When this spell ends, any suppressed effect resumes, provided that its duration has not expired in the meantime.Alternatively, you can make a target indifferent about creatures of your choice that it is hostile toward. This indifference ends if the target is attacked or harmed by a spell or if it witnesses any of its friends being harmed. When the spell ends, the creature becomes hostile again, unless the DM rules otherwise.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Cleric"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": ""
},
{
    "Name": "Crown of Madness",
    "Range": "120 feet",
    "Level": "2nd-level",
    "CastTime": "1 action",
    "Description": "One humanoid of your choice that you can see within range must succeed on a Wisdom saving throw or become charmed by you for the duration. While the target is charmed in this way, a twisted crown of jagged iron appears on its head, and a madness glows in its eyes.The charmed target must use its action before moving on each of its turns to make a melee attack against a creature other than itself that you mentally choose. The target can act normally on its turn if you choose no creature or if none are within its reach.On your subsequent turns, you must use your action to maintain control over the target, or the spell ends. Also, the target can make a Wisdom saving throw at the end of each of its turns. On a success, the spell ends.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": ""
},
{
    "Name": "Enthrall",
    "Range": "60 feet",
    "Level": "2nd-level",
    "CastTime": "1 action",
    "Description": "You weave a distracting string of words, causing creatures of your choice that you can see within range and that can hear you to make a Wisdom saving throw. Any creature that can’t be charmed succeeds on this saving throw automatically, and if you or your companions are fighting a creature, it has advantage on the save. On a failed save, the target has disadvantage on Wisdom (Perception) checks made to perceive any creature other than you until the spell ends or until the target can no longer hear you. The spell ends if you are incapacitated or can no longer speak.",
    "Duration": "1 minute",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Warlock"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": ""
},
{
    "Name": "Hold Person",
    "Range": "60 feet",
    "Level": "2nd-level",
    "CastTime": "1 action",
    "Description": "Choose a humanoid that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Cleric",
        "Druid",
        "Sorcerer",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a small, straight piece of iron"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional humanoid for each slot level above 2nd. The humanoids must be within 30 feet of each other when you target them."
},
{
    "Name": "Suggestion",
    "Range": "30 feet",
    "Level": "2nd-level",
    "CastTime": "1 action",
    "Description": "You suggest a course of activity (limited to a sentence or two) and magically influence a creature you can see within range that can hear and understand you. Creatures that can’t be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act ends the spell.The target must make a Wisdom saving throw. On a failed save, it purses the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration. If the suggested activity can be completed in a shorter time, the spell ends when the subject finishes what it was asked to do.You can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that a knight give her warhorse to the first beggar she meets. If the condition isn’t met before the spell expires, the activity isn’t performed.If you or any of your companions damage the target, the spell ends.",
    "Duration": "Concentration, up to 8 hours",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "M",
        "a snake’s tongue and either a bit of honeycomb or a drop of sweet oil"
    ],
    "HigherLevels": ""
},
{
    "Name": "Charm Monster",
    "Range": "30 feet",
    "Level": "4th-level",
    "CastTime": "1 action",
    "Description": "You attempt to charm a creature you can see within range. It must make a Wisdom saving throw, and it does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature is friendly to you. When the spell ends, the creature knows it was charmed by you.",
    "Duration": "1 hour",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Druid",
        "Sorcerer",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th. The creatures must be within 30 feet of each other when you target them."
},
{
    "Name": "Compulsion",
    "Range": "30 feet",
    "Level": "4th-level",
    "CastTime": "1 action",
    "Description": "Creatures of your choice that you can see within range and that can hear you must make a Wisdom saving throw. A target automatically succeeds on this saving throw if it can’t be charmed. On a failed save, a target is affected by this spell. Until the spell ends, you can use a bonus action on each of your turns to designate a direction that is horizontal to you. Each affected target must use as much of its movement as possible to move in that direction on its next turn. It can take its action before it moves. After moving in this way, it can make another Wisdom saving throw to try to end the effect.A target isn’t compelled to move into an obviously deadly hazard, such as a fire pit, but it will provoke opportunity attacks to move in the designated direction.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": ""
},
{
    "Name": "Confusion",
    "Range": "90 feet",
    "Level": "4th-level",
    "CastTime": "1 action",
    "Description": "This spell assaults and twists creatures’ minds, spawning delusions and provoking uncontrolled actions. Each creature in a 10-foot-radius sphere centered on a point you choose within range must succeed on a Wisdom saving throw when you cast this spell or be affected by it.An affected target can’t take reactions and must roll a d10 at the start of each of its turns to determine its behavior for that turn.d10 \tBehavior1 \tThe creature uses all its movement to move in a random direction. To determine the direction, roll a d8 and assign a direction to each die face. The creature doesn’t take an action this turn.2-6 \tThe creature doesn’t move or take actions this turn.7-8 \tThe creature uses its action to make a melee attack against a randomly determined creature within its reach. If there is no creature within its reach, the creature does nothing this turn.9-10 \tThe creature can act and move normally.At the end of its turns, an affected target can make a Wisdom saving throw. If it succeeds, this effect ends for that target.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Druid",
        "Sorcerer",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "three nut shells"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 5th level or higher, the radius of the sphere increases by 5 feet for each slot level above 4th."
},
{
    "Name": "Dominate Beast",
    "Range": "60 feet",
    "Level": "4th-level",
    "CastTime": "1 action",
    "Description": "You attempt to beguile a beast that you can see within range. It must succeed on a Wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw.While the beast is charmed, you have a telepathic link with it as long as the two of you are on the same plane of existence. You can use this telepathic link to issue commands to the creature while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as “Attack that creature,” “Run over there,” or “Fetch that object.” If the creature completes the order and doesn’t receive further direction from you, it defends and preserves itself to the best of its ability.You can use your action to take total and precise control of the target. Until the end of your next turn, the creature takes only the actions you choose, and doesn’t do anything that you don’t allow it to do. During this time, you can also cause the creature to use a reaction, but this requires you to use your own reaction as well.Each time the target takes damage, it makes a new Wisdom saving throw against the spell. If the saving throw succeeds, the spell ends.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Druid",
        "Ranger (Optional)",
        "Sorcerer"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": "When you cast this spell with a 5th-level spell slot, the duration is concentration, up to 10 minutes. When you use a 6th-level spell slot, the duration is concentration, up to 1 hour. When you use a spell slot of 7th level or higher, the duration is concentration, up to 8 hours"
},
{
    "Name": "Dominate Person",
    "Range": "60 feet",
    "Level": "5th-level",
    "CastTime": "1 action",
    "Description": "You attempt to beguile a humanoid that you can see within range. It must succeed on a Wisdom saving throw or be charmed by you for the duration. If you or creatures that are friendly to you are fighting it, it has advantage on the saving throw.While the target is charmed, you have a telepathic link with it as long as the two of you are on the same plane of existence. You can use this telepathic link to issue commands to the creature while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as \"Attack that creature\", \"Run over there\", or \"Fetch that object\". If the creature completes the order and doesn’t receive further direction from you, it defends and preserves itself to the best of its ability.You can use your action to take total and precise control of the target. Until the end of your next turn, the creature takes only the actions you choose, and doesn’t do anything that you don’t allow it to do. During this time you can also cause the creature to use a reaction, but this requires you to use your own reaction as well.Each time the target takes damage, it makes a new Wisdom saving throw against the spell. If the saving throw succeeds, the spell ends.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Sorcerer",
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": "When you cast this spell using a 6th-level spell slot, the duration is concentration, up to 10 minutes. When you use a 7th-level spell slot, the duration is concentration, up to 1 hour. When you use a spell slot of 8th level or higher, the duration is concentration, up to 8 hours."
},
{
    "Name": "Geas",
    "Range": "60 feet",
    "Level": "5th-level",
    "CastTime": "1 minute",
    "Description": "You place a magical command on a creature that you can see within range, forcing it to carry out some service or refrain from some action or course of activity as you decide.If the creature can understand you, it must succeed on a Wisdom saving throw or become charmed by you for the duration. While the creature is charmed by you, it takes 5d10 psychic damage each time it acts in a manner directly counter to your instructions, but no more than once each day. A creature that can’t understand you is unaffected by the spell.You can issue any command you choose, short of an activity that would result in certain death. Should you issue a suicidal command, the spell ends. You can end the spell early by using an action to dismiss it. A Remove Curse, Greater Restoration, or Wish spell also ends it.",
    "Duration": "30 days",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Cleric",
        "Druid",
        "Paladin",
        "Wizard"
    ],
    "Components": [
        "V"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 7th or 8th level, the duration is 1 year. When you cast this spell using a spell slot of 9th level, the spell lasts until it is ended by one of the spells mentioned above."
},
{
    "Name": "Hold Monster",
    "Range": "90 feet",
    "Level": "5th-level",
    "CastTime": "1 action",
    "Description": "Choose a creature that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. This spell has no effect on undead. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a small, straight piece of iron"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 6th level or higher, you can target one additional creature for each slot level above 5th. The creatures must be within 30 feet of each other when you target them."
},
{
    "Name": "Modify Memory",
    "Range": "30 feet",
    "Level": "5th-level",
    "CastTime": "1 action",
    "Description": "You attempt to reshape another creature’s memories. One creature that you can see must make a Wisdom saving throw. If you are fighting the creature, it has advantage on the saving throw. On a failed save, the target becomes charmed by you for the duration. The charmed target is incapacitated and unaware of its surroundings, though it can still hear you. If it takes any damage or is targeted by another spell, this spell ends, and none of the target’s memories are modified.While this charm lasts, you can affect the target’s memory of an event that it experienced within the last 24 hours and that lasted no more than 10 minutes. You can permanently eliminate all memory of the event, allow the target to recall the event with perfect clarity and exacting detail, change its memory of the details of the event, or create a memory of some other event.You must speak to the target to describe how its memories are affected, and it must be able to understand your language for the modified memories to take root. Its mind fills in any gaps in the details of your description. If the spell ends before you have finished describing the modified memories, the creature’s memory isn’t altered. Otherwise, the modified memories take hold when the spell ends.A modified memory doesn’t necessarily affect how a creature behaves, particularly if the memory contradicts the creature’s natural inclinations, alignment, or beliefs. An illogical modified memory, such as implanting a memory of how much the creature enjoyed dousing itself in acid, is dismissed, perhaps as a bad dream. The DM might deem a modified memory too nonsensical to affect a creature in a significant manner.A Remove Curse or Greater Restoration spell cast on the target restores the creature’s true memory.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": "If you cast this spell using a spell slot of 6th level or higher, you can alter the target’s memories of an event that took place up to 7 days ago (6th level), 30 days ago (7th level), 1 year ago (8th level), or any time in the creature’s past (9th level)."
}]