[{
    "Name": "Minor Illusion",
    "Range": "30 feet",
    "Level": "cantrip",
    "CastTime": "1 action",
    "Description": "You create a sound or an image of an object within range that lasts for the duration. The illusion also ends if you dismiss it as an action or cast this spell again.If you create a sound, its volume can range from a whisper to a scream. It can be your voice, someone else’s voice, a lion’s roar, a beating of drums, or any other sound you choose. The sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends.If you create an image of an object—such as a chair, muddy footprints, or a small chest—it must be no larger than a 5-foot cube. The image can’t create sound, light, smell, or any other sensory effect. Physical interaction with the image reveals it to be an illusion, because things can pass through it.If a creature uses its action to examine the sound or image, the creature can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the illusion becomes faint to the creature.",
    "Duration": "1 minute",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "S",
        "M",
        "a bit of fleece"
    ],
    "HigherLevels": ""
},
{
    "Name": "Color Spray",
    "Range": "Self (15-foot cone)",
    "Level": "1st-level",
    "CastTime": "1 action",
    "Description": "A dazzling array of flashing, colored light springs from your hand. Roll 6d10, the total is how many hit points of creatures this spell can effect. Creatures in a 15-foot cone originating from you are affected in ascending order of their current hit points (ignoring unconscious creatures and creatures that can’t see).Starting with the creature that has the lowest current hit points, each creature affected by this spell is blinded until the end of your next turn. Subtract each creature’s hit points from the total before moving on to the creature with the next lowest hit points. A creature’s hit points must be equal to or less than the remaining total for the creature to be affected.",
    "Duration": "1 round",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Bard (Optional)",
        "Sorcerer",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a pinch of powder or sand that is colored red, yellow, and blue"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 2nd level or higher, roll an additional 2d10 for each slot level above 1st."
},
{
    "Name": "Disguise Self",
    "Range": "Self",
    "Level": "1st-level",
    "CastTime": "1 action",
    "Description": "You make yourself – including your clothing, armor, weapons, and other belongings on your person – look different until the spell ends or until you use your action to dismiss it. You can seem 1 foot shorter or taller and can appear thin, fat, or in between. You can’t change your body type, so you must adopt a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you.The changes wrought by this spell fail to hold up to physical inspection. For example, if you use this spell to add a hat to your outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel your head and hair. If you use this spell to appear thinner than you are, the hand of someone who reaches out to touch you would bump into you while it was seemingly still in midair. To discern that you are disguised, a creature can use its action to inspect your appearance and must succeed on an Intelligence (Investigation) check against your spell save DC.",
    "Duration": "1 hour",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Artificer",
        "Bard",
        "Sorcerer",
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": ""
},
{
    "Name": "Illusory Script",
    "Range": "Touch",
    "Level": "1st-level",
    "CastTime": "1 minute",
    "Description": "You write on parchment, paper, or some other suitable writing material and imbue it with a potent illusion that lasts for the duration.To you and any creatures you designate when you cast the spell, the writing appears normal, written in your hand, and conveys whatever meaning you intended when you wrote the text. To all others, the writing appears as if it were written in an unknown or magical script that is unintelligible. Alternatively, you can cause the writing to appear to be an entirely different message, written in a different hand and language, though the language must be one you know.Should the spell be dispelled, the original script and the illusion both disappear. A creature with truesight can read the hidden message.",
    "Duration": "10 days",
    "Concentration": "False",
    "Ritual": "True",
    "ClassList": [
        "Bard",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "S",
        "M",
        "a lead-based ink worth at least 10 gp, which the spell consumes"
    ],
    "HigherLevels": ""
},
{
    "Name": "Silent Image",
    "Range": "60 feet",
    "Level": "1st-level",
    "CastTime": "1 action",
    "Description": "You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 15-foot cube. The image appears at a spot within range and lasts for the duration. The image is purely visual; it isn’t accompanied by sound, smell, or other sensory effects.You can use your action to cause the image to move to any spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking.Physical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image.",
    "Duration": "Concentration, up to 10 minutes",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Sorcerer",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a bit of fleece"
    ],
    "HigherLevels": ""
},
{
    "Name": "Blur",
    "Range": "Self",
    "Level": "2nd-level",
    "CastTime": "1 action",
    "Description": "Your body becomes blurred, shifting and wavering to all who can see you. For the duration, any creature has disadvantage on attack rolls against you. An attacker is immune to this effect if it doesn't rely on sight, as with blindsight, or can see through illusions, as with truesight.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Artificer",
        "Sorcerer",
        "Wizard"
    ],
    "Components": [
        "V"
    ],
    "HigherLevels": ""
},
{
    "Name": "Invisibility",
    "Range": "Touch",
    "Level": "2nd-level",
    "CastTime": "1 action",
    "Description": "A creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target’s person. The spell ends for a target that attacks or casts a spell.",
    "Duration": "Concentration, up to 1 hour",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Artificer",
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "an eyelash encased in gum arabic"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd."
},
{
    "Name": "Magic Mouth",
    "Range": "30 feet",
    "Level": "2nd-level",
    "CastTime": "1 minute",
    "Description": "You implant a message within an object in range, a message that is uttered when a trigger condition is met. Choose an object that you can see and that isn’t being worn or carried by another creature. Then speak the message, which must be 25 words or less, though it can be delivered over as long as 10 minutes. Finally, determine the circumstance that will trigger the spell to deliver your message.When that circumstance occurs, a magical mouth appears on the object and recites the message in your voice and at the same volume you spoke. If the object you chose has a mouth or something that looks like a mouth (for example, the mouth of a statue), the magical mouth appears there so that words appear to come from the object’s mouth. When you cast this spell, you can have the spell end after it delivers its message, or it can remain and repeats its message whenever the trigger occurs.The triggering circumstance can be as general or as detailed as you like, though it must be based on visual or audible conditions that occur within 30 feet of the object. For example, you could instruct the mouth to speak when any creature moves within 30 feet of the object or when a silver bell rings within 30 feet of it.",
    "Duration": "Until dispelled",
    "Concentration": "False",
    "Ritual": "True",
    "ClassList": [
        "Artificer",
        "Bard",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a small bit of honeycomb and jade dust worth at least 10 gp, which the spell consumes"
    ],
    "HigherLevels": ""
},
{
    "Name": "Mirror Image",
    "Range": "Self",
    "Level": "2nd-level",
    "CastTime": "1 action",
    "Description": "Three illusory duplicates of yourself appear in your space. Until the spell ends, the duplicates move with you and mimic your actions, shifting position so it’s impossible to track which image is real. You can use your action to dismiss the illusory duplicates.Each time a creature targets you with an attack during the spell’s duration, roll a d20 to determine whether the attack instead targets one of your duplicates.If you have three duplicates, you must roll a 6 or higher to change the attack’s target to a duplicate. With two duplicates, you must roll an 8 or higher. With one duplicate, you must roll an 11 or higher.A duplicate’s AC equals 10 + your Dexterity modifier. If an attack hits a duplicate, the duplicate is destroyed. A duplicate can be destroyed only by an attack that hits it. It ignores all other damage and effects. The spell ends when all three duplicates are destroyed.A creature is unaffected by this spell if it can’t see, if it relies on senses other than sight, such as blindsight, or if it can perceive illusions as false, as with truesight.",
    "Duration": "1 minute",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Bard (Optional)",
        "Sorcerer",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": ""
},
{
    "Name": "Nystul's Magic Aura",
    "Range": "Touch",
    "Level": "2nd-level",
    "CastTime": "1 action",
    "Description": "You place an illusion on a creature or an object you touch so that divination spells reveal false information about it. The target can be a willing creature or an object that isn’t being carried or worn by another creature.When you cast the spell, choose one or both of the following effects. The effect lasts for the duration. If you cast this spell on the same creature or object every day for 30 days, placing the same effect on it each time, the illusion lasts until it is dispelled.False Aura. You change the way the target appears to spells and magical effects, such as Detect Magic, that detect magical auras. You can make a nonmagical object appear magical, a magical object appear nonmagical, or change the object’s magical aura so that it appears to belong to a specific school of magic that you choose. When you use this effect on an object, you can make the false magic apparent to any creature that handles the item.Mask. You change the way the target appears to spells and magical effects that detect creature types, such as a paladin’s Divine Sense or the trigger of a symbol spell. You choose a creature type and other spells and magical effects treat the target as if it were a creature of that type or of that alignment.",
    "Duration": "24 hours",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a small square of silk"
    ],
    "HigherLevels": ""
},
{
    "Name": "Phantasmal Force",
    "Range": "60 feet",
    "Level": "2nd-level",
    "CastTime": "1 action",
    "Description": "You craft an illusion that takes root in the mind of a creature that you can see within range. The target must make an Intelligence saving throw. On a failed save, you create a phantasmal object, creature, or other visible phenomenon of your choice that is no larger than a 10-foot cube and that is perceivable only to the target for the duration. This spell has no effect on undead or constructs.The phantasm includes sound, temperature, and other stimuli, also evident only to the creature.The target can use its action to examine the phantasm with an Intelligence (Investigation) check against your spell save DC. If the check succeeds, the target realizes that the phantasm is an illusion, and the spell ends.While a target is affected by the spell, the target treats the phantasm as if it were real. The target rationalizes any illogical outcomes from interacting with the phantasm. For example, a target attempting to walk across a phantasmal bridge that spans a chasm falls once it steps onto the bridge. If the target survives the fall, it still believes that the bridge exists and comes up with some other explanation for its fall; it was pushed, it slipped, or a strong wind might have knocked it off.An affected target is so convinced of the phantasm’s reality that it can even take damage from the illusion. A phantasm created to appear as a creature can attack the target. Similarly, a phantasm created to appear as fire, a pool of acid, or lava can burn the target. Each round on your turn, the phantasm can deal 1d6 psychic damage to the target if it is in the phantasm’s area or within 5 feet of the phantasm, provided that the illusion is of a creature or hazard that could logically deal damage, such as by attacking. The target perceives the damage as a type appropriate to the illusion.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Sorcerer",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a bit of fleece"
    ],
    "HigherLevels": ""
},
{
    "Name": "Silence",
    "Range": "120 feet",
    "Level": "2nd-level",
    "CastTime": "1 action",
    "Description": "For the duration, no sound can be created within or pass through a 20-foot-radius sphere centered on a point you choose within range. Any creature or object entirely inside the sphere is immune to thunder damage, and creatures are deafened while entirely inside it. Casting a spell that includes a verbal component is impossible there.",
    "Duration": "Concentration, up to 10 minutes",
    "Concentration": "True",
    "Ritual": "True",
    "ClassList": [
        "Bard",
        "Cleric",
        "Ranger"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": ""
},
{
    "Name": "Fear",
    "Range": "Self (30-foot cone)",
    "Level": "3rd-level",
    "CastTime": "1 action",
    "Description": "You project a phantasmal image of a creature’s worst fears. Each creature in a 30-foot cone must succeed on a Wisdom saving throw or drop whatever it is holding and become frightened for the duration.While frightened by this spell, a creature must take the Dash action and move away from you by the safest available route on each of its turns, unless there is nowhere to move. If the creature ends its turn in a location where it doesn’t have line of sight to you, the creature can make a Wisdom saving throw. On a successful save, the spell ends for that creature.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a white feather or the heart of a hen"
    ],
    "HigherLevels": ""
},
{
    "Name": "Hypnotic Pattern",
    "Range": "120 feet",
    "Level": "3rd-level",
    "CastTime": "1 action",
    "Description": "You create a twisting pattern of colors that weaves through the air inside a 30-foot cube within range. The pattern appears for a moment and vanishes. Each creature in the area who sees the pattern must make a Wisdom saving throw. On a failed save, the creature becomes charmed for the duration. While charmed by this spell, the creature is incapacitated and has a speed of 0.The spell ends for an affected creature if it takes any damage or if someone else uses an action to shake the creature out of its stupor.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "S",
        "M",
        "a glowing stick of incense or a crystal vial filled with phosphorescent material"
    ],
    "HigherLevels": ""
},
{
    "Name": "Major Image",
    "Range": "120 feet",
    "Level": "3rd-level",
    "CastTime": "1 action",
    "Description": "You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 20-foot cube. The image appears at a spot that you can see within range and lasts for the duration. It seems completely real, including sounds, smells, and temperature appropriate to the thing depicted. You can’t create sufficient heat or cold to cause damage, a sound loud enough to deal thunder damage or deafen a creature, or a smell that might sicken a creature (like a troglodyte’s stench).As long as you are within range of the illusion, you can use your action to cause the image to move to any other spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking. Similarly, you can cause the illusion to make different sounds at different times, even making it carry on a conversation, for example.Physical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image, and its other sensory qualities become faint to the creature.",
    "Duration": "Concentration, up to 10 minutes",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a bit of fleece"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 6th level or higher, the spell lasts until dispelled, without requiring your concentration. In this form it is sometimes considered a different spell, known as Permanent Image."
},
{
    "Name": "Phantom Steed",
    "Range": "30 feet",
    "Level": "3rd-level",
    "CastTime": "1 minute",
    "Description": "A Large quasi-real, horselike creature appears on the ground in an unoccupied space of your choice within range. You decide the creature’s appearance, but it is equipped with a saddle, bit, and bridle. Any of the equipment created by the spell vanishes in a puff of smoke if it is carried more than 10 feet away from the steed.For the duration, you or a creature you choose can ride the steed. The creature uses the statistics for a riding horse, except it has a speed of 100 feet and can travel 10 miles in an hour, or 13 miles at a fast pace. When the spell ends, the steed gradually fades, giving the rider 1 minute to dismount. The spell ends if you use an action to dismiss it or if the steed takes any damage.",
    "Duration": "1 hour",
    "Concentration": "False",
    "Ritual": "True",
    "ClassList": [
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": ""
},
{
    "Name": "Greater Invisibility",
    "Range": "Touch",
    "Level": "4th-level",
    "CastTime": "1 action",
    "Description": "You or a creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target’s person.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Sorcerer",
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": ""
},
{
    "Name": "Hallucinatory Terrain",
    "Range": "300 feet",
    "Level": "4th-level",
    "CastTime": "10 minutes",
    "Description": "You make natural terrain in a 150-foot cube in range look, sound, and smell like some other sort of natural terrain. Thus, open fields or a road can be made to resemble a swamp, hill, crevasse, or some other difficult or impassable terrain. A pond can be made to seem like a grassy meadow, a precipice like a gentle slope, or a rock-strewn gully like a wide and smooth road. Manufactured structures, equipment, and creatures within the area aren’t changed in appearance.The tactile characteristics of the terrain are unchanged, so creatures entering the area are likely to see through the illusion. If the difference isn’t obvious by touch, a creature carefully examining the illusion can attempt an Intelligence (Investigation) check against your spell save DC to disbelieve it. A creature who discerns the illusion for what it is, sees it as a vague image superimposed on the terrain.",
    "Duration": "24 hours",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Druid",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a stone, a twig, and a bit of green plant"
    ],
    "HigherLevels": ""
},
{
    "Name": "Phantasmal Killer",
    "Range": "120 feet",
    "Level": "4th-level",
    "CastTime": "1 action",
    "Description": "You tap into the nightmares of a creature you can see within range and create an illusory manifestation of its deepest fears, visible only to that creature.The target must make a Wisdom saving throw. On a failed save, the target becomes frightened for the duration. At the end of each of the target’s turns before the spell ends, the target must succeed on a Wisdom saving throw or take 4d10 psychic damage. On a successful save, the spell ends.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard (Optional)",
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d10 for each slot level above 4th."
},
{
    "Name": "Creation",
    "Range": "30 feet",
    "Level": "5th-level",
    "CastTime": "1 minute",
    "Description": "You pull wisps of shadow material from the Shadowfell to create a nonliving object of vegetable matter within range: soft goods, rope, wood, or something similar. You can also use this spell to create mineral objects such as stone, crystal, or metal. The object created must be no larger than a 5-foot cube, and the object must be of a form and material that you have seen before.The duration depends on the object’s material. If the object is composed of multiple materials, use the shortest duration.Material \tDurationVegetable matter \t1 dayStone, crystal \t12 hoursPrecious metals \t1 hourGems \t10 minutesAdamantine, Mithral \t1 minuteUsing any material created by this spell as another spell’s material component causes that spell to fail.",
    "Duration": "Special",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Artificer",
        "Sorcerer",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a tiny piece of matter of the same type of the item you plan to create"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 6th level or higher, the cube increases by 5 feet for each slot level above 5th."
},
{
    "Name": "Dream",
    "Range": "Special",
    "Level": "5th-level",
    "CastTime": "1 minute",
    "Description": "This spell shapes a creature’s dreams. Choose a creature known to you as the target of this spell. The target must be on the same plane of existence as you. Creatures that don’t sleep, such as elves, can’t be contacted by this spell. You, or a willing creature you touch, enters a trance state, acting as a messenger. While in the trance, the messenger is aware of their surroundings, but can’t take actions or move.If the target is asleep, the messenger appears in the target’s dreams and can converse with the target as long as it remains asleep, through the duration of the spell. The messenger can also shape the environment of the dream, creating landscapes, objects, and other images. The messenger can emerge from the trance at any time, ending the effect of the spell early. The target recalls the dream perfectly upon waking. If the target is awake when you cast the spell, the messenger knows it, and can either end the trance (and the spell) or wait for the target to fall asleep, at which point the messenger appears in the target’s dreams.You can make the messenger appear monstrous and terrifying to the target. If you do, the messenger can deliver a message of no more than ten words and then the target must make a Wisdom saving throw. On a failed save, echoes of the phantasmal monstrosity spawn a nightmare that lasts the duration of the target’s sleep and prevents the target from gaining any benefit from that rest. In addition, when the target wakes up, it takes 3d6 psychic damage.If you have a body part, lock of hair, clipping from a nail, or similar portion of the target’s body, the target makes its saving throw with disadvantage.",
    "Duration": "8 hours",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a handful of sand, a dab of ink, and a writing quill plucked from a sleeping bird"
    ],
    "HigherLevels": ""
},
{
    "Name": "Mislead",
    "Range": "Self",
    "Level": "5th-level",
    "CastTime": "1 action",
    "Description": "You become invisible at the same time that an illusory double of you appears where you are standing. The double lasts for the duration, but the invisibility ends if you attack or cast a spell.You can use your action to move your illusory double up to twice your speed and make it gesture, speak, and behave in whatever way you choose.You can see through its eyes and hear through its ears as if you were located where it is. On each of your turns as a bonus action, you can switch from using its senses to using your own, or back again. While you are using its senses, you are blinded and deafened in regard to your own surroundings.",
    "Duration": "Concentration, up to 1 hour",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Warlock (Optional)",
        "Wizard"
    ],
    "Components": [
        "S"
    ],
    "HigherLevels": ""
},
{
    "Name": "Seeming",
    "Range": "30 feet",
    "Level": "5th-level",
    "CastTime": "1 action",
    "Description": "This spell allows you to change the appearance of any number of creatures that you can see within range. You give each target you choose a new, illusory appearance. An unwilling target can make a Charisma saving throw, and if it succeeds, it is unaffected by this spell.The spell disguises physical appearances as well as clothing, armor, weapons, and equipment. You can make each creature seem 1 foot shorter or taller and appear thin, fat, or in-between. You can’t change a target’s body type, so you must choose a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you. The spell lasts for the duration, unless you use your action to dismiss it sooner.The changes wrought by this spell fail to hold up to physical inspections. For example, if you use this spell to add a hat to a creature’s outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel the creature’s head and hair. If you use this spell to appear thinner then you are, the hand of someone who reaches out to touch you would bump into you while it was seemingly still in midair.A creature can use its action to inspect a target and make an Intelligence (Investigation) check against your spell save DC. If it succeeds, it becomes aware that the target is disguised.",
    "Duration": "8 hours",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Bard",
        "Sorcerer",
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": ""
}]