[{
    "Name": "Toll the Dead",
    "Range": "60 feet",
    "Level": "cantrip",
    "CastTime": "1 action",
    "Description": "You point at one creature you can see within range, and the sound of a dolorous bell fills the air around it for a moment. The target must succeed on a Wisdom saving throw or take 1d8 necrotic damage. If the target is missing any of its hit points, it instead takes 1d12 necrotic damage.",
    "Duration": "Instantaneous",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Cleric",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": "The spell’s damage increases by one die when you reach 5th level (2d8 or 2d12), 11th level (3d8 or 3d12), and 17th level (4d8 or 4d12)."
},
{
    "Name": "Cause Fear",
    "Range": "60 feet",
    "Level": "1st-level",
    "CastTime": "1 action",
    "Description": "You awaken the sense of mortality in one creature you can see within range. A construct or an undead is immune to this effect. The target must succeed on a Wisdom saving throw or become frightened of you until the spell ends. The frightened target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them."
},
{
    "Name": "Life Transference",
    "Range": "30 feet",
    "Level": "3rd-level",
    "CastTime": "1 action",
    "Description": "You sacrifice some of your health to mend another creature’s injuries. You take 4d8 necrotic damage, which can’t be reduced in any way, and one creature of your choice that you can see within range regains a number of hit points equal to twice the necrotic damage you take.",
    "Duration": "Instantaneous",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Cleric",
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8 for each slot level above 3rd."
},
{
    "Name": "Shadow Of Moil",
    "Range": "Self",
    "Level": "4th-level",
    "CastTime": "1 action",
    "Description": "Flame-like shadows wreathe your body until the spell ends, causing you to become heavily obscured to others. The shadows turn dim light within 10 feet of you into darkness, and bright light in the same area to dim light.Until the spell ends, you have resistance to radiant damage. In addition, whenever a creature within 10 feet of you hits you with an attack, the shadows lash out at that creature, dealing it 2d8 necrotic damage.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Warlock"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "an undead eyeball encased in a gem worth at least 150 gp"
    ],
    "HigherLevels": ""
},
{
    "Name": "Danse Macabre",
    "Range": "60 feet",
    "Level": "5th-level",
    "CastTime": "1 action",
    "Description": "Threads of dark power leap from your fingers to pierce up to five Small or Medium corpses you can see within range. Each corpse immediately stands up and becomes undead. You decide whether it is a zombie or a skeleton (the statistics for zombies and skeletons are in the Monster Manual), and it gains a bonus to its attack and damage rolls equal to your spellcasting ability modifier. You can use a bonus action to mentally command the creatures you make with this spell, issuing the same command to all of them. To receive the command, a creature must be within 60 feet of you. You decide what action the creatures will take and where they will move during their next turn, or you can issue a general command, such as to guard a chamber or passageway against your foes. If you issue no commands, the creatures do nothing except defend themselves against hostile creatures. Once given an order, the creatures continue to follow it until their task is complete.The creatures are under your control until the spell ends, after which they become inanimate once more.",
    "Duration": "Concentration, up to 1 hour",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": "When you cast this spell using a spell slot‘ of 6th level or higher, you animate up to two additional corpses for each slot level above 5th."
},
{
    "Name": "Enervation",
    "Range": "60 feet",
    "Level": "5th-level",
    "CastTime": "1 action",
    "Description": "A tendril of inky darkness reaches out from you, touching a creature you can see within range to drain life from it. The target must make a Dexterity saving throw. On a successful save, the target takes 2d8 necrotic damage, and the spell ends. On a failed save, the target takes 4d8 necrotic damage, and until the spell ends, you can use your action on each of your turns to automatically deal 4d8 necrotic damage to the target. The spell ends if you use your action to do anything else, if the target is ever outside the spell’s range, or if the target has total cover from you. Whenever the spell deals damage to a target, you regain hit points equal to half the amount of necrotic damage the target takes.",
    "Duration": "Concentration, up to 1 minute",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Sorcerer",
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "S"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 6th level or higher, the damage increases by 1d8 for each slot level above 5th."
},
{
    "Name": "Negative Energy Flood",
    "Range": "60 feet",
    "Level": "5th-level",
    "CastTime": "1 action",
    "Description": "You send ribbons of negative energy at one creature you can see within range. Unless the target is undead, it must make a Constitution saving throw, taking 5d12 necrotic damage on a failed save, or half as much damage on a successful one. A target killed by this damage rises up as a zombie at the start of your next turn. The zombie pursues whatever creature it can see that is closest to it. Statistics for the zombie are in the Monster Manual. If you target an undead with this spell, the target doesn’t make a saving throw. Instead, roll 5d12. The target gains half the total as temporary hit points.",
    "Duration": "Instantaneous",
    "Concentration": "False",
    "Ritual": "False",
    "ClassList": [
        "Warlock",
        "Wizard"
    ],
    "Components": [
        "V",
        "M",
        "a broken bone and a square of black silk"
    ],
    "HigherLevels": ""
}]