[{
    "Name": "Summon Beast",
    "Range": "90 feet",
    "Level": "2nd-level",
    "CastTime": "1 action",
    "Description": "You call forth a bestial spirit. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Bestial Spirit stat block. When you cast the spell, choose an environment: Air, Land, or Water. The creature resembles an animal of your choice that is native to the chosen environment, which determines certain traits in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends.The creature is an ally to you and your companions. In combat, the creature shares your initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don’t issue any, it takes the Dodge action and uses its move to avoid danger.",
    "Duration": "Concentration, up to 1 hour",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "When you cast this spell using a spell slot of 3rd level or higher",
        "use the higher level where the spell’s level appears in the stat block."
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a feather, tuft of fur, and fish tail inside a gilded acorn worth at least 200 gp"
    ],
    "HigherLevels": ""
},
{
    "Name": "Summon Shadowspawn",
    "Range": "90 feet",
    "Level": "3rd-level",
    "CastTime": "1 action",
    "Description": "You call forth a shadowy spirit. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Shadow Spirit stat block. When you cast the spell, choose an emotion: Fury, Despair, or Fear. The creature resembles a misshapen biped marked by the chosen emotion, which determines certain traits in its stat block. The creature disappears when it drop to 0 hit points or when the spell ends.The creature is an ally to you and your companions. In combat, the creature shares your initiative count, but it takes its turn immediately after your. It obeys your verbal commands (no action required by you). If you don’t issue any, it takes the Dodge action and it uses its move to avoid danger.",
    "Duration": "Concentration, up to 1 hour",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Warlock (Optional)",
        "Wizard (Optional)"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "tears inside a crystal vial worth at least 300 gp"
    ],
    "HigherLevels": "When you cast the spell using a spell slot of 4th level or higher, use the higher level wherever the spell’s level appears on the stat block."
},
{
    "Name": "Summon Aberration",
    "Range": "90 feet",
    "Level": "4th-level",
    "CastTime": "1 action",
    "Description": "You call forth an aberrant spirit. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Aberrant Spirit stat block. When you cast the spell, choose Beholderkin, Slaad, or Star Spawn. The creature resembles an aberration of that kind, which determines certain traits in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends.The creature is an ally to you and your companions. In combat, the creature shares your initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don’t issue any, it take the Dodge action and uses its move to avoid danger.",
    "Duration": "Concentration, up to 1 hour",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Warlock (Optional)",
        "Wizard (Optional)"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a pickled tentacle and an eyeball in a platinum inlaid vial worth at least 400 gp"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 5th level or higher, use the higher level wherever the spell's level appears on the stat block."
},
{
    "Name": "Summon Construct",
    "Range": "90 feet",
    "Level": "4th-level",
    "CastTime": "1 action",
    "Description": "You call forth the spirit of a construct. It manifests in an unoccupied space that you can see within range. This corporeal form uses the Construct Spirit stat block. When you cast the spell, choose a material: Clay, Metal, or Stone. The creature resembles a golem or a modron (your choice) made of the chosen material, which determines certain traits in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends.The creature is an ally to you and your companions. In combat, the creature shares your initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don’t issue any, it takes the Dodge action and uses its move to avoid danger.",
    "Duration": "Concentration, up to 1 hour",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Artificer",
        "Wizard (Optional)"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "an ornate stone and metal lockbox worth at least 400 gp"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 4th level or higher, use the higher level wherever the spell’s level appears in the stat block."
},
{
    "Name": "Summon Celestial",
    "Range": "90 feet",
    "Level": "5th-level",
    "CastTime": "1 action",
    "Description": "You call forth a celestial spirit. It manifests in an angelic form in an unoccupied space that you can see within range. This corporeal form uses the Celestial Spirit stat block. When you cast the spell, choose Avenger or Defender. Your choice determines the creature’s attack in its stat block. The creature disappears when it drops to 0 hit points or when the spell ends.The creature is an ally to you and your companions. In combat, the creature shares your initiative count, but it takes its turn immediately after yours. It obeys your verbal commands (no action required by you). If you don’t issue any, it takes the Dodge action and uses its move to avoid danger.",
    "Duration": "Concentration, up to 1 hour",
    "Concentration": "True",
    "Ritual": "False",
    "ClassList": [
        "Cleric (Optional)",
        "Paladin (Optional)"
    ],
    "Components": [
        "V",
        "S",
        "M",
        "a golden reliquary worth at least 500 gp"
    ],
    "HigherLevels": "When you cast this spell using a spell slot of 6th level or higher, use the higher level whenever the spell’s level appears in the stat block."
}]